app/views/users/show.html.erb

  <ul>
    <% current_user.cats.each do |cat| %>
---
SELECT "cats".* FROM "cats"  WHERE "cats"."user_id" = $1  [["user_id", 1]]