app/views/cats/_rental_requests.html.erb

SELECT "cat_rental_requests".* FROM "cat_rental_requests"  WHERE "cat_rental_requests"."cat_id" = $1  ORDER BY start_date  [["cat_id", 1]]
SELECT "users".* FROM "users"  WHERE "users"."id" IN (2)
---
  </tr>
  <% cat.rental_requests.includes(:user).order("start_date").each do |req| %>